tutorials/suspensionFoam/RAS/duneTransport/initSimpleFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1e-3;

// channel dimensions
length         900;
height         90;
width          6.03;

// dune dimensions and coordinates
duneHeight     25;
duneLength     94;
dunePos        200;

nxinlet        51;
nxdune         16;
nxoutlet       218;
nzlo           20;
nzup           20;
gzlo           5;
gzup           0.2;

h2             #eval{ 0.5 * $height };
h2Dune         #eval{ $h2 + 0.5 * $duneHeight };
xupDune        #eval{ $dunePos - 0.5 * ($duneLength) };
xdoDune        #eval{ $dunePos + 0.5 * ($duneLength) };



vertices        
(
    // lower vertices
    (0 0 0)  // 0
    (0 $width 0)  // 1
    ($xupDune 0 0)  // 2
    ($xupDune $width 0)  // 3
    ($dunePos 0 $duneHeight)  // 4
    ($dunePos $width $duneHeight)  // 5
    ($xdoDune 0 0)  // 6
    ($xdoDune $width 0)  // 7
    ($length 0 0)  // 8
    ($length $width 0)  // 9
    
    // middle vertices
    (0 0 $h2)  // 10
    (0 $width $h2)  // 11
    ($xupDune 0 $h2)  // 12
    ($xupDune $width $h2)  // 13
    ($dunePos 0 $h2Dune)  // 14
    ($dunePos $width $h2Dune)  // 15
    ($xdoDune 0 $h2)  // 16
    ($xdoDune $width $h2)  // 17
    ($length 0 $h2)  // 18
    ($length $width $h2)  // 19
    
    // upper vertices
    (0 0 $height)  // 20
    (0 $width $height)  // 21
    ($xupDune 0 $height)  // 22
    ($xupDune $width $height)  // 23
    ($dunePos 0 $height)  // 24
    ($dunePos $width $height)  // 25
    ($xdoDune 0 $height)  // 26
    ($xdoDune $width $height)  // 27
    ($length 0 $height)  // 28
    ($length $width $height)  // 29
);

blocks
(
    // lower blocks
    hex (0 2 3 1 10 12 13 11) ($nxinlet 1 $nzlo) simpleGrading (1 1 $gzlo)
    hex (2 4 5 3 12 14 15 13) ($nxdune 1 $nzlo) simpleGrading (1 1 $gzlo)
    hex (4 6 7 5 14 16 17 15) ($nxdune 1 $nzlo) simpleGrading (1 1 $gzlo)
    hex (6 8 9 7 16 18 19 17) ($nxoutlet 1 $nzlo) simpleGrading (1 1 $gzlo)
    
    // upper block
    hex (10 12 13 11 20 22 23 21) ($nxinlet 1 $nzup) simpleGrading (1 1 $gzup)
    hex (12 14 15 13 22 24 25 23) ($nxdune 1 $nzup) simpleGrading (1 1 $gzup)
    hex (14 16 17 15 24 26 27 25) ($nxdune 1 $nzup) simpleGrading (1 1 $gzup)
    hex (16 18 19 17 26 28 29 27) ($nxoutlet 1 $nzup) simpleGrading (1 1 $gzup)
    
);

edges
(
);

boundary
(
    inlet
    {
        type   patch;
        faces
            (
                (0 10 11 1)
                (10 20 21 11)
            );
    }
    outlet
    {
        type   patch;
        faces
            (
                (8 9 19 18)
                (18 19 29 28)
            );
    }
    top
    {
        type   wall;
        faces
            (
                (20 22 23 21)
                (22 24 25 23)
                (24 26 27 25)
                (26 28 29 27)
            );
    }
    bed
    {
        type   wall;
        faces
            (
                (0 1 3 2)
                (2 3 5 4)
                (4 5 7 6)
                (6 7 9 8)
            );
    }
    sides
    {
        type empty;
        faces
            (
                (0 2 12 10)
                (10 12 22 20)
                (2 4 14 12)
                (12 14 24 22)
                (4 6 16 14)
                (14 16 26 24)
                (6 8 18 16)
                (16 18 28 26)
                (3 1 11 13)
                (13 11 21 23)
                (5 3 13 15)
                (15 13 23 25)
                (7 5 15 17)
                (17 15 25 27)
                (9 7 17 19)
                (19 17 27 29)
            );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
