tutorials/suspensionFoam/RAS/duneTransport/initSimpleFoam/0_org/Uinlet
nonuniform List<vector> 
40
(
(1.30881e-05 0 2.0821e-18)
(0.146569 0 1.48785e-15)
(0.225713 0 8.10501e-16)
(0.280292 0 8.82146e-16)
(0.322468 0 8.89813e-16)
(0.357288 0 8.94978e-16)
(0.387281 0 8.96856e-16)
(0.413877 0 8.96993e-16)
...
)
;
