tutorials/suspensionFoam/RAS/duneTransport/initSimpleFoam/0_org/kinlet
nonuniform List<scalar> 
40
(
0.00833876
0.00909996
0.00880303
0.00854481
0.00831286
0.00808914
0.00786377
0.00763118
...
)
;
