tutorials/suspensionFoam/RAS/duneTransport/initSimpleFoam/0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        //value           #include "nutinlet";;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    bed
    {
        type            nutkRoughWallFunction;
	Ks              uniform 100e-6;
	Cs              uniform 0.5;
	value           $internalField;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
