tutorials/suspensionFoam/RAS/duneTransport/initSimpleFoam/0_org/nutinlet
nonuniform List<scalar> 
40
(
8.4065e-06
2.40503e-05
4.18128e-05
6.12102e-05
8.1805e-05
0.000103374
0.00012577
0.000148864
...
)
;