tutorials/suspensionFoam/RAS/duneTransport/initSimpleFoam/0_org/omegainlet
nonuniform List<scalar> 
40
(
991.941
378.372
210.534
139.598
101.618
78.251
62.525
51.2626
...
)
;