tutorials/suspensionFoam/RAS/duneTransport/initSimpleFoam/0_org/pinlet
nonuniform List<scalar> 
40
(
-1.31389e-15
-2.38885e-15
-2.96732e-15
-3.69588e-15
-4.577e-15
-5.61949e-15
-6.83607e-15
-8.24259e-15
...
)
;
