tutorials/suspensionFoam/RAS/duneTransport/initSimpleFoam/Allrun
#!/bin/sh

# Create the mesh
blockMesh

# create the initial time folder
cp -r 0_org 0

# Run suspensionFoam
simpleFoam > log
